<h3>Контент</h3>
<p>1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.</p>
<div><b><?=$result?></b></div>
<p>2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:</p>
<div><b><?=$res?></b></div>
<p>3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области.</p>
<div><b><?=$city?></b></div>