<h3>Контент</h3>
<p>1.Объявить две целочисленные переменные $a и $b и задать им произвольные начальные значения. Затем написать скрипт, который работает по следующему принципу:</p>
<p>если $a и $b положительные, вывести а и б положительные;</p>
<p>если $а и $b отрицательные, вывести а и б отрицательные;</p>
<p>если $а и $b разных знаков, вывести а и б разных знаков;</p>
<div><b><?=$result?></b></div>
<p>2. Присвоить переменной $а значение в промежутке [0..15]. С помощью оператора switch организовать вывод чисел от $a до 15. При желании сделайте это задание через рекурсию.</p>
<div><b><?=$res?></b></div>
<p>3. Реализовать основные 4 арифметические операции в виде функций с двумя параметрами. Обязательно использовать оператор return. В делении проверьте деление на 0 и верните текст ошибки.</p>
<div><b>sum: <?=$sum?></b></div>
<div><b>min: <?=$min?></b></div>
<div><b>mul: <?=$mul?></b></div>
<div><b>div: <?=$div?></b></div>
<p>4. Реализовать функцию с тремя параметрами: function mathOperation($arg1, $arg2, $operation), где $arg1, $arg2 – значения аргументов, $operation – строка с названием операции. 
    В зависимости от переданного значения операции выполнить одну из арифметических операций (использовать функции из пункта 3) и вернуть полученное значение (использовать switch).</p>
<div><b><?=$resOperation?></b></div>
<p>6. *С помощью рекурсии организовать функцию возведения числа в степень. Формат: function power($val, $pow), где $val – заданное число, $pow – степень.</p>
<div><b><?=$pow?></b></div>
